[M_Sage_NowYouSeeIt MissionDefinition]
MissionDescription="There is a fearsome stalker known as Bloodtail who can only be attracted by a certain kind of pheromone. Hammerlock has offered you a vial of the pheromone in question.<br><br>Whenever you're ready, Hammerlock wants you to apply the pheromone and go a-hunting for Bloodtail."
TeaserText="Who's ready to get stinky?"
